tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/wallBoiling/0.orig/T.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 368;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 368;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.liquid;
        inletValue      uniform 368;
        value           uniform 368;
    }

    wall1
    {
        type            zeroGradient;
    }

    wall2
    {
        type            fixedMultiPhaseHeatFlux;
        relax           0.5;
        q               uniform 0;
        phase           liquid;
        value           uniform 368;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
